# Основы pandas

In [3]:
import pandas as pd

Пример забора данных с сайтов

In [8]:
pd.read_html('http://www.cbr.ru')[0]

  Курсы валют с 05.06.2020 с 06.06.2020
0  Доллар США     69,0151₽     68,6319₽
1        Евро     77,3245₽     77,9658₽

In [9]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [10]:
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  04.06.20    691371    685742    695510   684455
 1  03.06.20    685745    687170    689338   681995
 2  02.06.20    687155    691451    691725   685840
 3  01.06.20    691375    701995    703202   689895
 4  31.05.20    703485    702620    705680   702620
 5  29.05.20    702000    705259    708550   700580
 6  28.05.20    705385    708795    712363   701380
 7  27.05.20    708805    708098    714810   707260
 8  26.05.20    708112    715717    716716   706055,
        Имя  Unnamed: 1      %    курс                 Дата
 0  EUR/RUB         NaN -12929   77379  05.06.2020 15:47:00
 1  USD/RUB         NaN -10238  684293  05.06.2020 15:47:00
 2  CHF/RUB         NaN -16625  711913  05.06.2020 15:47:00
 3  JPY/RUB         NaN -14548    6244  05.06.2020 15:48:00
 4  GBP/RUB         NaN  -4966  866252  05.06.2020 15:48:00
 5  NOK/RUB         NaN  -4912   73505  05.06.2020 15:47:00
 6  AUD/RUB         NaN  -5732  477061  05.06.2020 15:48:00
 7  NZD/RUB         NaN  -3331     445  05.06.2020 15:47:00
 8  TRY/RUB         NaN -12361  101105  05.06.2020 15:47:00]

Импорт данных из файла

In [32]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [10]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [11]:
type(data)

pandas.core.frame.DataFrame

In [2]:
# если надо указать свои заголовки и разделитель
data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
data.head()

NameError: name 'pd' is not defined

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 1 columns):
страна    1189482 non-null object
dtypes: object(1)
memory usage: 9.1+ MB

In [5]:
# если надо указать свои заголовки и разделитель
#data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\n', header=0)
#data.head()

In [12]:
# количество строк в датафрейме

len(data)

1189482

In [13]:
# или так
data.shape

(1189482, 4)

In [ ]:
#если с результатом нужно поработать
#data = pd.read_csv('power.csv').shape

Простые вычисления для нового столбца

In [14]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [15]:
data = pd.read_csv('transactions.csv')
data.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [19]:
data.shape

(60, 8)

In [16]:
data.to_csv('temp.csv', index = False)

### Основные сведения о датафрейме

In [25]:
#информация о DataFrame. В столбцах количество строчек равно количесту строк в таблице, т е пропусков в столбцах нет
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
country     1189482 non-null object
year        1189482 non-null int64
quantity    1189482 non-null float64
category    1189482 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [26]:
# немного статистики

data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [22]:
#можно дата фрейм создать руками, например, чтобы потестить какую-нибудь ситуацию, если нарушить кол-во строк то будет ошибка
df = pd.DataFrame(
    {'user_id': [1, 1, 1, 4, 5], 'revenue': [100, 200, 200, 200, 200]}
)

df

   user_id  revenue
0        1      100
1        1      200
2        1      200
3        4      200
4        5      200

In [23]:
df['user_id'].unique()

array([1, 4, 5], dtype=int64)

In [21]:
type(df['user_id'].unique())

numpy.ndarray

In [28]:
#удаляет дупликаты, при этом параметр 'last' - выбирает последнее значение в дубликатах
df = df.drop_duplicates('user_id', keep = 'last')

In [29]:
#При этом сам DataFrame не изменился, т к операция выше не присвоилась какому - нибудь значению и наоборот
df

   user_id  revenue
2        1      200
3        4      200
4        5      200

### Отдельный столбец (тип Series)

In [33]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [34]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [35]:
type(data['year'])

pandas.core.series.Series

In [36]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [31]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [32]:
len(data['category'].unique())

71

In [33]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [37]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [36]:
#normalize=True - нужнол ли процентное значения строчек или нет
data['category'].value_counts(normalize=True).head()*100

67    11.258346
27     8.209036
24     6.316363
42     5.394029
37     5.225468
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [38]:
hhhh = pd.read_csv('transactions.csv')
hhhh.Product.value_counts(normalize=True).head(1)*100

_5    18.333333
Name: Product, dtype: float64

In [39]:
len(hhhh['Product'].unique())

10

# Фильтры

In [39]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [45]:
# выбрать несколько столбцов + одновременная сортировка по столбцам

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [46]:
# или так без параметра сортировки items
data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [51]:
#Нужно обращать внимание на одинарные или двойные скобки. Это таблица
type(data[['country']].head())

pandas.core.frame.DataFrame

In [52]:
#Нужно обращать внимание на одинарные или двойные скобки. Это просто столбец
type(data['country'].head())

pandas.core.series.Series

In [54]:
#gпервая строчка
data.loc[0]

country     Austria
year           1996
quantity          5
category          1
Name: 0, dtype: object

In [55]:
type(data.loc[0])

pandas.core.series.Series

In [57]:
data.loc[0:5]

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1

### Отфильтруем строки с потреблением выше среднего

In [60]:
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [59]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [61]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [64]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [65]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [66]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [67]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [68]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [69]:
filtered_countries. info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23697 entries, 6940 to 1189193
Data columns (total 4 columns):
country     23697 non-null object
year        23697 non-null int64
quantity    23697 non-null float64
category    23697 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 1.5+ MB

In [70]:
# тип object это то же самое что и строка
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [ ]:
# фильтры на номер строки, границы и правая и левая отбражаются

data.loc[1000:1005]

# Сортировка

In [71]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [72]:
# сортировка по убыванию, ascending - возрастание

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [74]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(200)

             country  year      quantity  category
835127   Afghanistan  2014  1.935442e+06        42
491541   Afghanistan  2014  6.600000e+04        31
492004   Afghanistan  2014  6.600000e+04        31
492292   Afghanistan  2014  6.600000e+04        31
791301   Afghanistan  2014  5.537080e+03        42
...              ...   ...           ...       ...
547874       Albania  2014  1.591000e+02        32
552338       Albania  2014  1.591000e+02        32
650368       Albania  2014  1.572900e+02        37
1001473      Albania  2014  1.515000e+02        60
988796       Albania  2014  1.511500e+02        60

[200 rows x 4 columns]

### Параметр inplace

In [75]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [77]:
#inplace это параметр который перезаписывает исходный файл, т е создавать новую переменную не надо
data.sort_values(['country', 'quantity', 'country'], inplace=True)

            country  year    quantity  category
24226   Afghanistan  1991        -1.0         4
24227   Afghanistan  1990        -1.0         4
9994    Afghanistan  1992         0.0         4
12132   Afghanistan  1992         0.0         4
14902   Afghanistan  1992         0.0         4
...             ...   ...         ...       ...
491540     Zimbabwe  1990   5820000.0        31
492604     Zimbabwe  1993   7355000.0        31
492605     Zimbabwe  1990   7355000.0        31
492289     Zimbabwe  2014  25502000.0        31
492603     Zimbabwe  2014  25502000.0        31

[1189482 rows x 4 columns]

In [ ]:
rewrite = True
data.sort_values('country', ascending=True, inplace=rewrite)

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

In [ ]:
?data.sort_values

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?